app/controllers/queries_controller.rb

  def index
    @queries = Query.all
---
SELECT "queries".* FROM "queries"

  def create
    # different tracks if you're querying for a current address or an address and date
    if query_params["today"]
      month = Date.today.month.to_s
      day = Date.today.day.to_s
      year = Date.today.year.to_s
     @query = Query.new(address_string: query_params[:address_string].to_s,
      month: month,
      day: day,
      year: year)
     # p @query.inspect
    else
      @query = Query.new(query_params)
      # p @query.inspect
    end
    if logged_in?
      @query.users << current_user
---
INSERT INTO "queries" ("address_string", "month", "year", "day", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address_string", "534 Washington Ave, Newtown PA"], ["month", "06"], ["year", "2006"], ["day", "06"], ["created_at", "2016-06-14 17:42:52.331485"], ["updated_at", "2016-06-14 17:42:52.331485"]]

    def set_query
      @query = Query.find(params[:id])
---
SELECT  "queries".* FROM "queries" WHERE "queries"."id" = $1 LIMIT 1  [["id", nil]]