app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "spanky"]]
---
  def create
    @user = User.find_by(username: session_params[:username])